<?php

#1-Задания 
/*
$radius = 5.0;

echo  'Площадь круга: ' . (($radius*$radius)* M_PI) . '<br>';
*/

#2-Задания 
/*
$name = 'O\'tkirbay';
$age = '19';

echo 'Меня зовут ' . $name . ',' . ' мне ' . ' ' . $age . ' лет ' . ', ' . 'я программист.';
*/

#3-Задания
/*
$num1 = 10; $num2 = 5;

echo 'Сумма: ' . ( $num1 + $num2 ) . '<br>';
echo 'Разность: ' . ( $num1 - $num2 ) . '<br>';
echo 'Произведение: ' . ( $num1 * $num2 ) . '<br>';
echo 'Частное: ' . ( $num1 / $num2 ) . '<br>';
*/

#4-Задания
/*
$a = 10;
$b = 5;

echo 'Площадь прямоугольника: ' . $a * $b . '<br>';
echo 'Периметр прямоугольника: ' . 2 * ($a + $b) . '<br>';
*/

#5-Задания
/*
$num1 = 7;
$num2 = 3;

echo 'Сумма: ' . ($num1 + $num2) . '<br>';
echo 'Разность: ' . ($num1 - $num2) . '<br>';
echo 'Произведение: ' . ($num1 * $num2) . '<br>';
echo 'Частное: ' . ($num1 / $num2) . '<br>';
*/