<?php
#Qatarlar menen islesiw. (Строковые операции)

$str = "Hello";
echo  "VAR: $str" . "!"; 

//Бызлер echo да html параметрлерынде шыгарсак болады.

echo "<input type=\"text\">";

//функциялар
//strlen() фунциясы - бул функция бызлерге стрингтагы символлар санын санап береды.

echo strlen($str) ."<br>";

//trim() функциясы - бул функция бызлерге пробелларды алп таслау ымканын береды.

echo trim(" asddasd ");
echo " 123123 ";

//strtolower() функциясы - бул функция бызлерге Улкен регистрдагы стрингларды кышы стрингка откерып береды.
//strtoupper() функциясы болса керысынше улкен регистрга откерып береды.

// Кириллица текстлер ушын регистырлер:

//mb_strtolower()
//mb_strtoupper()

//md5() функциясы - бул функция бызге стрингты кешлап береды. 
